Activites Week 11

In [37]:
import pandas as pd

df = pd.read_csv("/workspaces/data_3500_in_class_code/Lecture_code/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Programming Activity 1
Using the Titanic dataset and the Pandas library, fill in any missing data cells in the 'ages' column with the median age.

In [38]:
df = df.rename(columns={"Pclass":"Class"})
df = df.rename(columns={"Parch":"Parent/Child"})
df = df.rename(columns={"SibSp":"Sibling/Spouse"})
df.head()

,PassengerId,Survived,Class,Name,Sex,Age,Sibling/Spouse,Parent/Child,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [39]:
df.isnull().sum()

PassengerId         0
Survived            0
Class               0
Name                0
Sex                 0
Age               177
Sibling/Spouse      0
Parent/Child        0
Ticket              0
Fare                0
Cabin             687
Embarked            2
dtype: int64

In [40]:
df["Age"].fillna(df["Age"].median(), inplace=True)

/tmp/ipykernel_2099/2097741607.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].median(), inplace=True)

In [41]:
df.isnull().sum()

PassengerId         0
Survived            0
Class               0
Name                0
Sex                 0
Age                 0
Sibling/Spouse      0
Parent/Child        0
Ticket              0
Fare                0
Cabin             687
Embarked            2
dtype: int64

Programming Activity 2
Using the Titanic dataset and the Pandas library, create a new column called 'FamilySize' and fill it with the size of the passenger's family.

In [42]:
df["Family Size"] = df["Sibling/Spouse"] + df["Parent/Child"] + 1
df.head()

,PassengerId,Survived,Class,Name,Sex,Age,Sibling/Spouse,Parent/Child,Ticket,Fare,Cabin,Embarked,Family Size
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

Programming Activity 3

Using the Titanic dataset and the Pandas library, find the average survival rate by class and sex.

In [43]:
df["Survived"] = df["Survived"].astype(bool)
df.groupby(["Class", "Sex"])["Survived"].mean()

Class  Sex
1      female    0.968085
       male      0.368852
2      female    0.921053
       male      0.157407
3      female    0.500000
       male      0.135447
Name: Survived, dtype: float64

Programming Activity 4

Using the Titanic dataset and the Pandas library, find the average fare per class.

In [44]:
average_fare_by_class = df.groupby("Class")["Fare"].mean()
print("Average Fare by Class:")
print(average_fare_by_class)

Average Fare by Class:
Class
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

Programming Activity 5

Using the Titanic dataset and the Pandas library, find the median age of survivors versus non-survivors.

In [45]:
median_age_by_survival = df.groupby("Survived")["Age"].median()
print("Median age by survival status (False = did not survive, True = survived):")
print(median_age_by_survival)

Median age by survival status (False = did not survive, True = survived):
Survived
False    28.0
True     28.0
Name: Age, dtype: float64

In [46]:
# Weather dataframe

df2 = pd.read_csv("/workspaces/data_3500_in_class_code/Lecture_code/SLC_weather.csv")
df2.head()

,Date,Max Temp,Min Temp,Avg Temp,Departure,HDD,CDD,Precipitation,New Snow,Snow Depth
0,10/1/2025,76,52,64.0,2.6,1,0,0,0,0
1,10/2/2025,84,57,70.5,9.6,0,6,0,0,0
2,10/3/2025,85,57,71.0,10.6,0,6,0.14,0,0
3,10/4/2025,57,46,51.5,-8.4,13,0,2.47,0,0
4,10/5/2025,59,47,53.0,-6.5,12,0,T,0,0

Programming Activity 6

Using the weather file (located on week 11 programming activities page), find the longest warm streak where the high temperature was above 65 degrees.

In [47]:
df2["Warm"] = df2["Max Temp"] > 65

current_streak = 0
longest_streak = 0

for is_warm in df2["Warm"]:
    if is_warm:
        current_streak += 1
        if current_streak > longest_streak:
            longest_streak = current_streak
    else:
        current_streak = 0  # reset when itâ€™s not a hot day

print("Longest hot streak:", longest_streak, "days")

Longest hot streak: 4 days

Programming Activity 7

Using the same weather dataset, find the hottest day and the coldest night.

In [50]:
coldest_night = df2.loc[df2["Min Temp"].idxmin()]
warmest_day = df2.loc[df2["Max Temp"].idxmax()]

print("Coldest night:")
print(coldest_night[["Date", "Min Temp"]])
print("\nWarmest day:")
print(warmest_day[["Date", "Max Temp"]])

Coldest night:
Date        10/28/2025
Min Temp            30
Name: 27, dtype: object

Warmest day:
Date        10/3/2025
Max Temp           85
Name: 2, dtype: object

Programming Activity 8

Using the same weather dataset, find the single most volatile day (the day with the biggest difference between high and low temperature).

In [ ]:
df2["Volatility"] = df2["Max Temp"] - df2["Min Temp"]

# Find the row with the highest volatility
most_volatile_day = df2.loc[df2["Volatility"].idxmax()]

print("Most volatile day:")
print(most_volatile_day[["Date", "Max Temp", "Min Temp", "Volatility"]])

Most volatile day:
Date          10/11/2025
Max Temp              77
Min Temp              42
Volatility            35
Name: 10, dtype: object